000100***************************************************************** 00000100
000200* 07/29/89 MSM, CREATED.                                        * 00000200
000300***************************************************************** 00000300
000400*                                                                 00000400
000500*     DFHRESP COPYBOOK                                            00000500
000600*                                                                 00000600
000700*     FIELDS ARE IN FORMAT DFHRESP-XXXXXXXX                       00000700
000800*     CAN BE COMPARED TO EIBRESP FIELD ORE RESP IDENTIFIER        00000800
000900*                                                                 00000900
001000*     SOURCE - CICS/OS/VS APRM COMMAND LEVEL (CICS 1.7)           00001000
001100*                                                                 00001100
001200 01  DFHRESP-ERROR-CODES.                                         00001200
001300     05  DFHRESP-NORMAL                  PIC S9(08)  VALUE +00.   00001300
001400     05  DFHRESP-ERROR                   PIC S9(08)  VALUE +01.   00001400
001500     05  DFHRESP-RDATT                   PIC S9(08)  VALUE +02.   00001500
001600     05  DFHRESP-WRBRK                   PIC S9(08)  VALUE +03.   00001600
001700     05  DFHRESP-EOF                     PIC S9(08)  VALUE +04.   00001700
001800     05  DFHRESP-EODS                    PIC S9(08)  VALUE +05.   00001800
001900     05  DFHRESP-EOC                     PIC S9(08)  VALUE +06.   00001900
002000     05  DFHRESP-INBFMH                  PIC S9(08)  VALUE +07.   00002000
002100     05  DFHRESP-ENDINPT                 PIC S9(08)  VALUE +08.   00002100
002200     05  DFHRESP-NONVAL                  PIC S9(08)  VALUE +09.   00002200
002300     05  DFHRESP-NOSTART                 PIC S9(08)  VALUE +10.   00002300
002400     05  DFHRESP-TERMIDERR               PIC S9(08)  VALUE +11.   00002400
002500     05  DFHRESP-DSIDERR                 PIC S9(08)  VALUE +12.   00002500
002600     05  DFHRESP-NOTFND                  PIC S9(08)  VALUE +13.   00002600
002700     05  DFHRESP-DUPREC                  PIC S9(08)  VALUE +14.   00002700
002800     05  DFHRESP-DUPKEY                  PIC S9(08)  VALUE +15.   00002800
002900     05  DFHRESP-INVREQ                  PIC S9(08)  VALUE +16.   00002900
003000     05  DFHRESP-IOERR                   PIC S9(08)  VALUE +17.   00003000
003100     05  DFHRESP-NOSPACE                 PIC S9(08)  VALUE +18.   00003100
003200     05  DFHRESP-NOTOPEN                 PIC S9(08)  VALUE +19.   00003200
003300     05  DFHRESP-ENDFILE                 PIC S9(08)  VALUE +20.   00003300
003400     05  DFHRESP-ILLOGIC                 PIC S9(08)  VALUE +21.   00003400
003500     05  DFHRESP-LENGERR                 PIC S9(08)  VALUE +22.   00003500
003600     05  DFHRESP-QZERO                   PIC S9(08)  VALUE +23.   00003600
003700     05  DFHRESP-SIGNAL                  PIC S9(08)  VALUE +24.   00003700
003800     05  DFHRESP-QBUSY                   PIC S9(08)  VALUE +25.   00003800
003900     05  DFHRESP-ITEMERR                 PIC S9(08)  VALUE +26.   00003900
004000     05  DFHRESP-PGMIDERR                PIC S9(08)  VALUE +27.   00004000
004100     05  DFHRESP-TRANSIDERR              PIC S9(08)  VALUE +28.   00004100
004200     05  DFHRESP-ENDDATA                 PIC S9(08)  VALUE +29.   00004200
004300     05  DFHRESP-INVTSREQ                PIC S9(08)  VALUE +30.   00004300
004400     05  DFHRESP-EXPIRED                 PIC S9(08)  VALUE +31.   00004400
004500     05  DFHRESP-RETPAGE                 PIC S9(08)  VALUE +32.   00004500
004600     05  DFHRESP-RTEFAIL                 PIC S9(08)  VALUE +33.   00004600
004700     05  DFHRESP-RTESOME                 PIC S9(08)  VALUE +34.   00004700
004800     05  DFHRESP-TSIOERR                 PIC S9(08)  VALUE +35.   00004800
004900     05  DFHRESP-MAPFAIL                 PIC S9(08)  VALUE +36.   00004900
005000     05  DFHRESP-INVERRTERM              PIC S9(08)  VALUE +37.   00005000
005100     05  DFHRESP-INVMPSZ                 PIC S9(08)  VALUE +38.   00005100
005200     05  DFHRESP-IGREQID                 PIC S9(08)  VALUE +39.   00005200
005300     05  DFHRESP-OVERFLOW                PIC S9(08)  VALUE +40.   00005300
005400     05  DFHRESP-INVLDC                  PIC S9(08)  VALUE +41.   00005400
005500     05  DFHRESP-NOSTG                   PIC S9(08)  VALUE +42.   00005500
005600     05  DFHRESP-JIDERR                  PIC S9(08)  VALUE +43.   00005600
005700     05  DFHRESP-QIDERR                  PIC S9(08)  VALUE +44.   00005700
005800     05  DFHRESP-NOJBUFSP                PIC S9(08)  VALUE +45.   00005800
005900     05  DFHRESP-DSSTAT                  PIC S9(08)  VALUE +46.   00005900
006000     05  DFHRESP-SELNERR                 PIC S9(08)  VALUE +47.   00006000
006100     05  DFHRESP-FUNCERR                 PIC S9(08)  VALUE +48.   00006100
006200     05  DFHRESP-UNEXPIN                 PIC S9(08)  VALUE +49.   00006200
006300     05  DFHRESP-NOPASSBKRD              PIC S9(08)  VALUE +50.   00006300
006400     05  DFHRESP-NOPASSBKWR              PIC S9(08)  VALUE +51.   00006400
006500     05  DFHRESP-ERROR-52                PIC S9(08)  VALUE +52.   00006500
006600     05  DFHRESP-SYSIDERR                PIC S9(08)  VALUE +53.   00006600
006700     05  DFHRESP-ISCINVREQ               PIC S9(08)  VALUE +54.   00006700
006800     05  DFHRESP-ENQBUSY                 PIC S9(08)  VALUE +55.   00006800
006900     05  DFHRESP-ENVDEFERR               PIC S9(08)  VALUE +56.   00006900
007000     05  DFHRESP-IGREQCD                 PIC S9(08)  VALUE +57.   00007000
007100     05  DFHRESP-SESSIONERR              PIC S9(08)  VALUE +58.   00007100
007200     05  DFHRESP-SYSBUSY                 PIC S9(08)  VALUE +59.   00007200
007300     05  DFHRESP-SESSBUSY                PIC S9(08)  VALUE +60.   00007300
007400     05  DFHRESP-NOTALLOC                PIC S9(08)  VALUE +61.   00007400
007500     05  DFHRESP-CBIDERR                 PIC S9(08)  VALUE +62.   00007500
007600     05  DFHRESP-ERROR-63                PIC S9(08)  VALUE +63.   00007600
007700     05  DFHRESP-INVPARTNSET             PIC S9(08)  VALUE +64.   00007700
007800     05  DFHRESP-INVPARTN                PIC S9(08)  VALUE +65.   00007800
007900     05  DFHRESP-PARTNFAIL               PIC S9(08)  VALUE +66.   00007900
008000     05  DFHRESP-ERROR-67                PIC S9(08)  VALUE +67.   00008000
008100     05  DFHRESP-ERROR-68                PIC S9(08)  VALUE +68.   00008100
008200     05  DFHRESP-ERROR-69                PIC S9(08)  VALUE +69.   00008200
008300     05  DFHRESP-NOTAUTH                 PIC S9(08)  VALUE +70.   00008300
008400     05  DFHRESP-ERROR-71                PIC S9(08)  VALUE +71.   00008400
008500     05  DFHRESP-ERROR-72                PIC S9(08)  VALUE +72.   00008500
008600     05  DFHRESP-ERROR-73                PIC S9(08)  VALUE +73.   00008600
008700     05  DFHRESP-ERROR-74                PIC S9(08)  VALUE +74.   00008700
008800     05  DFHRESP-ERROR-75                PIC S9(08)  VALUE +75.   00008800
008900     05  DFHRESP-ERROR-76                PIC S9(08)  VALUE +76.   00008900
009000     05  DFHRESP-ERROR-77                PIC S9(08)  VALUE +77.   00009000
009100     05  DFHRESP-ERROR-78                PIC S9(08)  VALUE +78.   00009100
009200     05  DFHRESP-ERROR-79                PIC S9(08)  VALUE +79.   00009200
009300     05  DFHRESP-NOSPOOL                 PIC S9(08)  VALUE +80.   00009300
009400     05  DFHRESP-TERMERR                 PIC S9(08)  VALUE +81.   00009400
009500     05  DFHRESP-ROLLEDBACK              PIC S9(08)  VALUE +82.   00009500
009600     05  DFHRESP-END                     PIC S9(08)  VALUE +83.   00009600
009700     05  DFHRESP-DISABLED                PIC S9(08)  VALUE +84.   00009700
009800     05  DFHRESP-ALLOCERR                PIC S9(08)  VALUE +85.   00009800
009900     05  DFHRESP-STRELERR                PIC S9(08)  VALUE +86.   00009900
010000     05  DFHRESP-OPENERR                 PIC S9(08)  VALUE +87.   00010000
010100     05  DFHRESP-SPOLBUSY                PIC S9(08)  VALUE +88.   00010100
010200     05  DFHRESP-SPOLERR                 PIC S9(08)  VALUE +89.   00010200
010300     05  DFHRESP-NODEIDER                PIC S9(08)  VALUE +90.   00010300
010400*                                                                 00010400
010500*                                                                 00010500
010600*    ***  END OF DFHRESP COPYBOOK. ***                            00010600
